app/Controllers/PeminjamSertifikat.php

    public function index()
    {

        $getPeminjam = $this->PeminjamSertifikatModel->findAll();
        $resultPeminjam = $this->PeminjamSertifikatModel->get()->resultID->num_rows;
---
SELECT *
FROM `data_peminjam_sertifikat`