app/Controllers/Peminjam.php

    public function index()
    {

        $getPeminjam = $this->PeminjamModel->findAll();
        $resultPeminjam = $this->PeminjamModel->get()->resultID->num_rows;
---
SELECT *
FROM `data_peminjam`

    public function create()
    {
        $getBpkb = $this->BpkbModel->where('status', 'Tidak Dipinjam')->findAll();
---
SELECT *
FROM `data_bpkb`
WHERE `status` = 'Tidak Dipinjam'