app/Models/BpkbModel.php

    public function getBpkb()
    {
        return $this->db->table('data_bpkb')
            ->join('bpkb_bahan_bakar', 'bpkb_bahan_bakar.id_bahan_bakar = data_bpkb.bahan_bakar')
            ->join('bpkb_model_kendaraan', 'bpkb_model_kendaraan.id_model = data_bpkb.model')
            ->join('bpkb_warna_tnkb', 'bpkb_warna_tnkb.id_warna_tnkb = data_bpkb.warna_tnkb')
            ->where('isActive', 1)
            ->get();
---
SELECT *
FROM `data_bpkb`
JOIN `bpkb_bahan_bakar` ON `bpkb_bahan_bakar`.`id_bahan_bakar` = `data_bpkb`.`bahan_bakar`
JOIN `bpkb_model_kendaraan` ON `bpkb_model_kendaraan`.`id_model` = `data_bpkb`.`model`
JOIN `bpkb_warna_tnkb` ON `bpkb_warna_tnkb`.`id_warna_tnkb` = `data_bpkb`.`warna_tnkb`
WHERE `isActive` = 1

    public function getDetail($id)
    {
        return $this->db->table('data_bpkb')
            ->join('bpkb_bahan_bakar', 'bpkb_bahan_bakar.id_bahan_bakar = data_bpkb.bahan_bakar')
            ->join('bpkb_model_kendaraan', 'bpkb_model_kendaraan.id_model = data_bpkb.model')
            ->join('bpkb_warna_tnkb', 'bpkb_warna_tnkb.id_warna_tnkb = data_bpkb.warna_tnkb')
            ->where('id_bpkb', $id)
            ->select('id_bpkb, nomor_registrasi, nama_pemilik, alamat, merk, tipe, bpkb_model_kendaraan.model, tahun_pembuatan, isi_silinder, nomor_rangka, nomor_mesin, warna, bpkb_bahan_bakar.bahan_bakar, bpkb_warna_tnkb.warna_tnkb, tahun_registrasi, nomor_bpkb, kode_lokasi, lokasi_kendaraan')
            ->get()->getRowArray();
---
SELECT `id_bpkb`, `nomor_registrasi`, `nama_pemilik`, `alamat`, `merk`, `tipe`, `bpkb_model_kendaraan`.`model`, `tahun_pembuatan`, `isi_silinder`, `nomor_rangka`, `nomor_mesin`, `warna`, `bpkb_bahan_bakar`.`bahan_bakar`, `bpkb_warna_tnkb`.`warna_tnkb`, `tahun_registrasi`, `nomor_bpkb`, `kode_lokasi`
FROM `data_bpkb`
JOIN `bpkb_bahan_bakar` ON `bpkb_bahan_bakar`.`id_bahan_bakar` = `data_bpkb`.`bahan_bakar`
JOIN `bpkb_model_kendaraan` ON `bpkb_model_kendaraan`.`id_model` = `data_bpkb`.`model`
JOIN `bpkb_warna_tnkb` ON `bpkb_warna_tnkb`.`id_warna_tnkb` = `data_bpkb`.`warna_tnkb`
WHERE `id_bpkb` = '32'

    public function getModelKendaraan()
    {
        return $this->db->table('bpkb_model_kendaraan')->get()->getResultArray();
---
SELECT *
FROM `bpkb_model_kendaraan`

    public function getImg($no_bpkb)
    {
        return $this->db->table('bpkb_gambar')->where('nomor_bpkb', $no_bpkb)->get()->getResultArray();
---
SELECT *
FROM `bpkb_gambar`
WHERE `nomor_bpkb` = '1231231'