app/Models/CetakPengantarModel.php

    public function findPejabat($data_pejabat)
    {
        return $this->db->table('data_pejabat')
            ->where('id_pengantar', $data_pejabat)
            ->get()->getRowArray();
---
SELECT *
FROM `data_pejabat`
WHERE `id_pengantar` = '1'