app/Models/PeminjamModel.php

SELECT `nama_lengkap`, `nik`, `data_bpkb`.`id_bpkb`, `data_bpkb`.`nomor_registrasi`, `nama_petugas_pinjam`, `nip_petugas_pinjam`, `nama_petugas_kembali`, `nip_petugas_kembali`, `nomor_surat`, `tgl_pinjam`, `tgl_kembali`, `data_peminjam`.`status`, `ket_lokasi`, `data_peminjam`.`lokasi_kendaraan`, `status_kendaraan`
FROM `data_peminjam`
JOIN `data_bpkb` ON `data_bpkb`.`id_bpkb` = `data_peminjam`.`id_bpkb`
WHERE `id_peminjam` = '48'
---
    public function getDetail($id)
    {
        return $this->db
            ->table('data_peminjam')
            ->join('data_bpkb', 'data_bpkb.id_bpkb = data_peminjam.id_bpkb')
            ->select('nama_lengkap, nik, data_bpkb.id_bpkb, data_bpkb.nomor_registrasi, nama_petugas_pinjam, nip_petugas_pinjam, nama_petugas_kembali, nip_petugas_kembali, nomor_surat, tgl_pinjam, tgl_kembali, data_peminjam.status , ket_lokasi, data_peminjam.lokasi_kendaraan, status_kendaraan')
            ->where('id_peminjam', $id)
            ->get()->getRowArray();

SELECT *
FROM `peminjam_gambar`
WHERE `nik` = '123123'
---
    public function getImg($nik)
    {
        return $this->db
            ->table('peminjam_gambar')
            ->where('nik', $nik)
            ->get()
            ->getResultArray();