app/Models/PeminjamSertifikatModel.php

SELECT `id_peminjam_sertifikat`, `nama_lengkap`, `nik`, `investasi`.`intro`, `investasi`.`nama_proyek`, `kecamatan`.`kecamatan`, `kelurahan`.`kelurahan`, `kategori`.`nm_kategori`, `lokasi`, `sub_kategori`.`nm_subkategori`, `keperluan`, `nama_petugas_pinjam`, `nip_petugas_pinjam`, `nama_petugas_kembali`, `nip_petugas_kembali`, `nomor_surat`, `tgl_pinjam`, `tgl_kembali`, `data_peminjam_sertifikat`.`status`
FROM `data_peminjam_sertifikat`
JOIN `investasi` ON `investasi`.`id` = `data_peminjam_sertifikat`.`id_sertifikat`
JOIN `kategori` ON `kategori`.`id_kategori` = `investasi`.`id_kategori`
JOIN `kecamatan` ON `kecamatan`.`id` = `investasi`.`id_kecamatan`
JOIN `kelurahan` ON `kelurahan`.`id` = `investasi`.`id_kelurahan`
JOIN `sub_kategori` ON `sub_kategori`.`id_subkategori` = `investasi`.`lokasi`
WHERE `id_peminjam_sertifikat` = '14'
---
    public function getDetail($id)
    {
        return $this->db
            ->table('data_peminjam_sertifikat')
            ->join('investasi', 'investasi.id = data_peminjam_sertifikat.id_sertifikat')
            ->join('kategori', 'kategori.id_kategori = investasi.id_kategori')
            ->join('kecamatan', 'kecamatan.id = investasi.id_kecamatan')
            ->join('kelurahan', 'kelurahan.id = investasi.id_kelurahan')
            ->join('sub_kategori', 'sub_kategori.id_subkategori = investasi.lokasi')
            ->select('id_peminjam_sertifikat, nama_lengkap, nik, investasi.intro, kecamatan.kecamatan, kelurahan.kelurahan, kategori.nm_kategori, lokasi, sub_kategori.nm_subkategori, keperluan, nama_petugas_pinjam, nip_petugas_pinjam, nama_petugas_kembali,nip_petugas_kembali, nomor_surat, tgl_pinjam, tgl_kembali, data_peminjam_sertifikat.status')
            ->where('id_peminjam_sertifikat', $id)
            ->get()->getRowArray();