app/Models/SertifikatModel.php

    public function getKecamatan()
    {
        return $this->db->table('kecamatan')->get()->getResultArray();
---
SELECT *
FROM `kecamatan`

    public function getKelurahan()
    {
        return $this->db->table('kelurahan')->get()->getResultArray();
---
SELECT *
FROM `kelurahan`

    public function getKategori()
    {
        return $this->db->table('kategori')->get()->getResultArray();
---
SELECT *
FROM `kategori`

    public function getSubKategori()
    {
        return $this->db->table('sub_kategori')->get()->getResultArray();
---
SELECT *
FROM `sub_kategori`

    public function getDetail($id)
    {
        return $this->db
            ->table('investasi')
            ->join('kategori', 'kategori.id_kategori = investasi.id_kategori')
            ->join('kecamatan', 'kecamatan.id = investasi.id_kecamatan')
            ->join('kelurahan', 'kelurahan.id = investasi.id_kelurahan')
            ->join('sub_kategori', 'sub_kategori.id_subkategori = investasi.lokasi')
            ->where('investasi.id', $id)
            ->select('investasi.id, nama_proyek, intro, aktif, intro2, kecamatan.kecamatan, kelurahan.kelurahan, kategori.nm_kategori, lokasi, sub_kategori.nm_subkategori, tahun, tgl_awal, img1, img2, img3, img4, img5, img6, img7, img8, img9, img10, img11, img12, img13, img14, img15, tgl_akhir')
            ->get()
            ->getRowArray();
---
SELECT `investasi`.`id`, `nama_proyek`, `intro`, `aktif`, `intro2`, `kecamatan`.`kecamatan`, `kelurahan`.`kelurahan`, `kategori`.`nm_kategori`, `lokasi`, `sub_kategori`.`nm_subkategori`, `tahun`, `tgl_awal`, `img1`, `img2`, `img3`, `img4`, `img5`, `img6`, `img7`, `img8`, `img9`, `img10`, `img11`, `img12`, `img13`, `img14`, `img15`, `tgl_akhir`
FROM `investasi`
JOIN `kategori` ON `kategori`.`id_kategori` = `investasi`.`id_kategori`
JOIN `kecamatan` ON `kecamatan`.`id` = `investasi`.`id_kecamatan`
JOIN `kelurahan` ON `kelurahan`.`id` = `investasi`.`id_kelurahan`
JOIN `sub_kategori` ON `sub_kategori`.`id_subkategori` = `investasi`.`lokasi`
WHERE `investasi`.`id` = '443'